lakshaysatija14-ux/STM32CubeIDE-Experiments/SSD1306_OLED_Display_Interface/Core/Src/main.c
/* USER CODE BEGIN Header */

/**

  ******************************************************************************

  * @file           : main.c

  * @brief          : Main program body

  ******************************************************************************

  * @attention

  *

  * Copyright (c) 2026 STMicroelectronics.

  * All rights reserved.

  *

  * This software is licensed under terms that can be found in the LICENSE file

  * in the root directory of this software component.

  * If no LICENSE file comes with this software, it is provided AS-IS.

  *

  ******************************************************************************

  */

/* USER CODE END Header */

/* Includes ------------------------------------------------------------------*/

#include "main.h"

#include "stm32l475e_iot01.h"

#include "stm32l475e_iot01_tsensor.h"

#include "stdlib.h"

#include "string.h"

#include "stdio.h"

#include <math.h>

#define SLAVE_ADDRESS_LCD 0x4E





/* Private includes ----------------------------------------------------------*/

/* USER CODE BEGIN Includes */



/* USER CODE END Includes */



/* Private typedef -----------------------------------------------------------*/

/* USER CODE BEGIN PTD */



/* USER CODE END PTD */



/* Private define ------------------------------------------------------------*/

/* USER CODE BEGIN PD */



/* USER CODE END PD */



/* Private macro -------------------------------------------------------------*/

/* USER CODE BEGIN PM */



/* USER CODE END PM */



/* Private variables ---------------------------------------------------------*/

I2C_HandleTypeDef hi2c1;



UART_HandleTypeDef huart1;



/* USER CODE BEGIN PV */

char str[40];

float temp_value = 0;  // Measured temperature value

char str_tmp[100] = ""; // Formatted message to display the temperature value

uint8_t msg3[] = "=====> Temperature sensor HTS221 initialized \r\n ";



/* USER CODE END PV */



/* Private function prototypes -----------------------------------------------*/

void SystemClock_Config(void);

static void MX_GPIO_Init(void);

static void MX_I2C1_Init(void);

static void MX_USART1_UART_Init(void);

/* USER CODE BEGIN PFP */



/* USER CODE END PFP */



/* Private user code ---------------------------------------------------------*/

/* USER CODE BEGIN 0 */

#define SLAVE_ADDRESS_LCD 0x4E



void lcd_send_data(char data) {

    char data_u, data_l;

    uint8_t data_t[4];

    data_u = (data & 0xf0);

    data_l = ((data << 4) & 0xf0);

    data_t[0] = data_u | 0x0D;  // en=1, rs=1

    data_t[1] = data_u | 0x09;  // en=0, rs=1

    data_t[2] = data_l | 0x0D;  // en=1, rs=1

    data_t[3] = data_l | 0x09;  // en=0, rs=1

    HAL_I2C_Master_Transmit(&hi2c1, SLAVE_ADDRESS_LCD, data_t, 4, 100);

    HAL_Delay(1);  // Small delay for LCD stability

}



void lcd_send_cmd(char cmd) {

    char data_u, data_l;

    uint8_t data_t[4];

    data_u = (cmd & 0xf0);

    data_l = ((cmd << 4) & 0xf0);

    data_t[0] = data_u | 0x0C;  // en=1, rs=0

    data_t[1] = data_u | 0x08;  // en=0, rs=0

    data_t[2] = data_l | 0x0C;  // en=1, rs=0

    data_t[3] = data_l | 0x08;  // en=0, rs=0

    HAL_I2C_Master_Transmit(&hi2c1, SLAVE_ADDRESS_LCD, data_t, 4, 100);

    HAL_Delay(2);  // Command needs more delay

}



void lcd_init(void) {

    HAL_Delay(50);

    lcd_send_cmd(0x30);

    HAL_Delay(5);

    lcd_send_cmd(0x30);

    HAL_Delay(5);

    lcd_send_cmd(0x30);

    HAL_Delay(5);

    lcd_send_cmd(0x20);  // 4-bit mode

    HAL_Delay(5);



    lcd_send_cmd(0x28);  // 4-bit, 2 lines

    lcd_send_cmd(0x08);  // Display off

    lcd_send_cmd(0x01);  // Clear

    HAL_Delay(2);

    lcd_send_cmd(0x06);  // Entry mode

    lcd_send_cmd(0x0C);  // Display on, no cursor

}



void lcd_clear(void) {

    lcd_send_cmd(0x01);

    HAL_Delay(2);

}

void lcd_set_cursor(uint8_t col, uint8_t row) {

    uint8_t address;

    if (row == 0) {

        address = 0x80 + col;

    } else {

        address = 0xC0 + col;

    }

    lcd_send_cmd(address);

}



void lcd_send_string(char *str) {

    while (*str) {

        lcd_send_data(*str++);

    }

}







/* USER CODE END 0 */



/**

  * @brief  The application entry point.

  * @retval int

  */

int main(void)

{



  /* USER CODE BEGIN 1 */



  /* USER CODE END 1 */



  /* MCU Configuration--------------------------------------------------------*/



  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */

  HAL_Init();



  /* USER CODE BEGIN Init */



  /* USER CODE END Init */



  /* Configure the system clock */

  SystemClock_Config();



  /* USER CODE BEGIN SysInit */



  /* USER CODE END SysInit */



  /* Initialize all configured peripherals */

  MX_GPIO_Init();

  MX_I2C1_Init();

  MX_USART1_UART_Init();

  /* USER CODE BEGIN 2 */

  BSP_TSENSOR_Init();

    HAL_UART_Transmit(&huart1, msg3, sizeof(msg3), 1000);

    // Initialize LCD once here

    lcd_init();

    HAL_Delay(100);



  /* USER CODE END 2 */



  /* Infinite loop */

  /* USER CODE BEGIN WHILE */

    static uint8_t lcd_initialized = 0;

    while (1)

  {

    /* USER CODE END WHILE */



    /* USER CODE BEGIN 3 */

	  temp_value = BSP_TSENSOR_ReadTemp();

	                snprintf(str_tmp, sizeof(str_tmp), "Temp: %.2f C\r\n", temp_value);

	   HAL_UART_Transmit(&huart1, (uint8_t*)str_tmp, strlen(str_tmp), 1000);

	                if(!lcd_initialized)

	                   {

	  	          lcd_init();

	  	          lcd_initialized = 1;

	  	      }





	  	      lcd_clear();

	            lcd_set_cursor(0, 0);  // <- This uses the function

	  	      lcd_send_string(str_tmp);





	  	      HAL_Delay(1000);



  }

  /* USER CODE END 3 */

}



/**

  * @brief System Clock Configuration

  * @retval None

  */

void SystemClock_Config(void)

{

  RCC_OscInitTypeDef RCC_OscInitStruct = {0};

  RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};



  /** Configure the main internal regulator output voltage

  */

  if (HAL_PWREx_ControlVoltageScaling(PWR_REGULATOR_VOLTAGE_SCALE1) != HAL_OK)

  {

    Error_Handler();

  }



  /** Initializes the RCC Oscillators according to the specified parameters

  * in the RCC_OscInitTypeDef structure.

  */

  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSI;

  RCC_OscInitStruct.HSIState = RCC_HSI_ON;

  RCC_OscInitStruct.HSICalibrationValue = RCC_HSICALIBRATION_DEFAULT;

  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;

  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSI;

  RCC_OscInitStruct.PLL.PLLM = 1;

  RCC_OscInitStruct.PLL.PLLN = 10;

  RCC_OscInitStruct.PLL.PLLP = RCC_PLLP_DIV7;

  RCC_OscInitStruct.PLL.PLLQ = RCC_PLLQ_DIV2;

  RCC_OscInitStruct.PLL.PLLR = RCC_PLLR_DIV2;

  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)

  {

    Error_Handler();

  }



  /** Initializes the CPU, AHB and APB buses clocks

  */

  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK

                              |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2;

  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;

  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;

  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV1;

  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;



  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_4) != HAL_OK)

  {

    Error_Handler();

  }

}



/**

  * @brief I2C1 Initialization Function

  * @param None

  * @retval None

  */

static void MX_I2C1_Init(void)

{



  /* USER CODE BEGIN I2C1_Init 0 */



  /* USER CODE END I2C1_Init 0 */



  /* USER CODE BEGIN I2C1_Init 1 */



  /* USER CODE END I2C1_Init 1 */

  hi2c1.Instance = I2C1;

  hi2c1.Init.Timing = 0x10D19CE4;

  hi2c1.Init.OwnAddress1 = 0;

  hi2c1.Init.AddressingMode = I2C_ADDRESSINGMODE_7BIT;

  hi2c1.Init.DualAddressMode = I2C_DUALADDRESS_DISABLE;

  hi2c1.Init.OwnAddress2 = 0;

  hi2c1.Init.OwnAddress2Masks = I2C_OA2_NOMASK;

  hi2c1.Init.GeneralCallMode = I2C_GENERALCALL_DISABLE;

  hi2c1.Init.NoStretchMode = I2C_NOSTRETCH_DISABLE;

  if (HAL_I2C_Init(&hi2c1) != HAL_OK)

  {

    Error_Handler();

  }



  /** Configure Analogue filter

  */

  if (HAL_I2CEx_ConfigAnalogFilter(&hi2c1, I2C_ANALOGFILTER_ENABLE) != HAL_OK)

  {

    Error_Handler();

  }



  /** Configure Digital filter

  */

  if (HAL_I2CEx_ConfigDigitalFilter(&hi2c1, 0) != HAL_OK)

  {

    Error_Handler();

  }

  /* USER CODE BEGIN I2C1_Init 2 */



  /* USER CODE END I2C1_Init 2 */



}



/**

  * @brief USART1 Initialization Function

  * @param None

  * @retval None

  */

static void MX_USART1_UART_Init(void)

{



  /* USER CODE BEGIN USART1_Init 0 */



  /* USER CODE END USART1_Init 0 */



  /* USER CODE BEGIN USART1_Init 1 */



  /* USER CODE END USART1_Init 1 */

  huart1.Instance = USART1;

  huart1.Init.BaudRate = 115200;

  huart1.Init.WordLength = UART_WORDLENGTH_8B;

  huart1.Init.StopBits = UART_STOPBITS_1;

  huart1.Init.Parity = UART_PARITY_NONE;

  huart1.Init.Mode = UART_MODE_TX_RX;

  huart1.Init.HwFlowCtl = UART_HWCONTROL_NONE;

  huart1.Init.OverSampling = UART_OVERSAMPLING_16;

  huart1.Init.OneBitSampling = UART_ONE_BIT_SAMPLE_DISABLE;

  huart1.AdvancedInit.AdvFeatureInit = UART_ADVFEATURE_NO_INIT;

  if (HAL_UART_Init(&huart1) != HAL_OK)

  {

    Error_Handler();

  }

  /* USER CODE BEGIN USART1_Init 2 */



  /* USER CODE END USART1_Init 2 */



}



/**

  * @brief GPIO Initialization Function

  * @param None

  * @retval None

  */

static void MX_GPIO_Init(void)

{

  /* USER CODE BEGIN MX_GPIO_Init_1 */



  /* USER CODE END MX_GPIO_Init_1 */



  /* GPIO Ports Clock Enable */

  __HAL_RCC_GPIOC_CLK_ENABLE();

  __HAL_RCC_GPIOH_CLK_ENABLE();

  __HAL_RCC_GPIOB_CLK_ENABLE();



  /* USER CODE BEGIN MX_GPIO_Init_2 */



  /* USER CODE END MX_GPIO_Init_2 */

}



/* USER CODE BEGIN 4 */



/* USER CODE END 4 */



/**

  * @brief  This function is executed in case of error occurrence.

  * @retval None

  */

void Error_Handler(void)

{

  /* USER CODE BEGIN Error_Handler_Debug */

  /* User can add his own implementation to report the HAL error return state */

  __disable_irq();

  while (1)

  {

  }

  /* USER CODE END Error_Handler_Debug */

}

#ifdef USE_FULL_ASSERT

/**

  * @brief  Reports the name of the source file and the source line number

  *         where the assert_param error has occurred.

  * @param  file: pointer to the source file name

  * @param  line: assert_param error line source number

  * @retval None

  */

void assert_failed(uint8_t *file, uint32_t line)

{

  /* USER CODE BEGIN 6 */

  /* User can add his own implementation to report the file name and line number,

     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */

  /* USER CODE END 6 */

}

#endif /* USE_FULL_ASSERT */
